---
kind: method
id: M:Autodesk.Revit.DB.TextRange.#ctor
source: html/bc22378b-bf4b-6535-3d32-b4a543c636fe.htm
---
# Autodesk.Revit.DB.TextRange.#ctor Method

Constructs a TextRange with default values for start and length.

## Syntax (C#)
```csharp
public TextRange()
```

## Remarks
The start and length are set to be 0 by default.